# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSizeSet..::..Contains Method
PaperSizeSet Class See Also
---
Tests for the existence of an item within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	PaperSize item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As PaperSize _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	PaperSize^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PaperSizeThe item to be searched for.
# ### Return Value
The Contains method returns True if the item is within the set, otherwise False.
# See Also
PaperSizeSet Class
Autodesk.Revit.DB Namespace